ERP DEV.КонтурМаркировка/src/DataProcessors/КонтурМаркировка/КонтурМаркировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонтурМаркировка</name>
  <comment>KonturMark.epf</comment>
</mdclass:DataProcessor>

ERP DEV.КонтурМаркировка/src/Enums/КонтурМаркировка_ВидыПродукции/КонтурМаркировка_ВидыПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурМаркировка_ВидыПродукции</name>
  <enumValues>
    <name>Табак</name>
  </enumValues>
  <enumValues>
    <name>Обувь</name>
  </enumValues>
  <enumValues>
    <name>Легпром</name>
  </enumValues>
  <enumValues>
    <name>Шины</name>
  </enumValues>
  <enumValues>
    <name>Парфюмерия</name>
  </enumValues>
  <enumValues>
    <name>Фототовары</name>
  </enumValues>
  <enumValues>
    <name>Молоко</name>
  </enumValues>
  <enumValues>
    <name>Велосипеды</name>
  </enumValues>
  <enumValues>
    <name>МедицинскиеИзделия</name>
  </enumValues>
  <enumValues>
    <name>Вода</name>
  </enumValues>
  <enumValues>
    <name>Пиво</name>
  </enumValues>
  <enumValues>
    <name>Бады</name>
  </enumValues>
  <enumValues>
    <name>Антисептики</name>
  </enumValues>
  <enumValues>
    <name>НикотиносодержащаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>БезалкогольноеПиво</name>
  </enumValues>
  <enumValues>
    <name>АльтернативныйТабак</name>
  </enumValues>
  <enumValues>
    <name>Морепродукты</name>
  </enumValues>
  <enumValues>
    <name>БезалкогольныеНапитки</name>
  </enumValues>
  <enumValues>
    <name>РастительныеМасла</name>
  </enumValues>
  <enumValues>
    <name>КормаДляЖивотных</name>
  </enumValues>
  <enumValues>
    <name>Ветпрепараты</name>
  </enumValues>
  <enumValues>
    <name>Игрушки</name>
  </enumValues>
  <enumValues>
    <name>Консервы</name>
  </enumValues>
  <enumValues>
    <name>Косметика</name>
  </enumValues>
  <enumValues>
    <name>Электроника</name>
  </enumValues>
  <enumValues>
    <name>Пиротехника</name>
  </enumValues>
  <enumValues>
    <name>МаслаИАвтомобильныеЖидкости</name>
  </enumValues>
  <enumValues>
    <name>Бакалея</name>
  </enumValues>
  <enumValues>
    <name>ПечатнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ОтопительныеПриборы</name>
  </enumValues>
  <enumValues>
    <name>СтроительныеМатериалы</name>
  </enumValues>
  <enumValues>
    <name>Оптоволокно</name>
  </enumValues>
  <enumValues>
    <name>Алкоголь</name>
  </enumValues>
  <enumValues>
    <name>КабельнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ПолимерныеТрубы</name>
  </enumValues>
  <enumValues>
    <name>Автозапчасти</name>
  </enumValues>
  <enumValues>
    <name>КондитерскиеИзделия</name>
  </enumValues>
  <enumValues>
    <name>МясныеИзделия</name>
  </enumValues>
  <enumValues>
    <name>ТоварыДляДомаИИнтерьера</name>
  </enumValues>
  <enumValues>
    <name>Удобрения</name>
  </enumValues>
  <enumValues>
    <name>НоутбукиИСмартфоны</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеСистемыДоставкиНикотина</name>
  </enumValues>
  <enumValues>
    <name>ПромышленноеОборудование</name>
  </enumValues>
  <enumValues>
    <name>ДетскоеПитание</name>
  </enumValues>
  <enumValues>
    <name>КормовыеДобавки</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикаты</name>
  </enumValues>
  <enumValues>
    <name>НатуральныйМех</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.КонтурМаркировка/src/Catalogs/КонтурМаркировка_Товары/КонтурМаркировка_Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурМаркировка_Товары</name>
  <attributes>
    <name>GTIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКодаМаркировки</name>
    <type>
      <types>EnumRef.КонтурМаркировка_ТипыКодовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.КонтурМаркировка_ВидыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрокаГодности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокументаСертификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаСертификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаСертификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодлежитВетеринарномуКонтролю</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛицензииНаНедра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЛицензииНаНедра</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВложенныйТовар</name>
    <type>
      <types>CatalogRef.КонтурМаркировка_Товары</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеременныйВес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.КонтурМаркировка_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКарточкиТовара</name>
    <type>
      <types>CatalogRef.КонтурМаркировка_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаМаркировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНабора</name>
    <attributes>
      <name>ВложенныйТовар</name>
      <type>
        <types>CatalogRef.КонтурМаркировка_Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВложений</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловияХранения</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрешительнаяДокументация</name>
    <attributes>
      <name>Основной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешительныйДокумент</name>
      <type>
        <types>CatalogRef.КонтурМаркировка_РазрешительныеДокументы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.КонтурМаркировка/src/DataProcessors/КонтурМаркировка/Forms/Форма_ЗагрузкаТоваров/Module.bsl
// #Область СлужебныеПеременныеИМетодыФормы

&НаСервере
Перем КэшМодуляОбъекта;

&НаКлиенте
Перем КэшМодуляКлиента;

&НаСервере
Функция МодульОбъекта()
	
	Если КэшМодуляОбъекта <> Неопределено Тогда
		Возврат КэшМодуляОбъекта;
	КонецЕсли;
	
	КэшМодуляОбъекта = ВзаимодействиеКонтурМаркировка.МодульМаркировки(Истина);
	
	Возврат КэшМодуляОбъекта;
	
КонецФункции

&НаКлиенте
Функция МодульКлиента()
	
	Если КэшМодуляКлиента <> Неопределено Тогда
		Возврат КэшМодуляКлиента;
	КонецЕсли;
	
	КэшМодуляКлиента = ВзаимодействиеКонтурМаркировкаКлиент.МодульМаркировкиКлиент(Истина);
	
	Возврат КэшМодуляКлиента;
	
КонецФункции

// КонецОбласти // СлужебныеПеременныеИМетодыФормы

// #Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьТаблицуТоваров();
	
	ЗаполнитьСпискиВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидПродукцииПриИзменении(Элемент)
	
	Если МодульКлиента().ВидПродукцииПоддерживаетВСД(ВидПродукции) Тогда
		ПодлежитВетеринарномуКонтролю = "1";
	Иначе
		ПодлежитВетеринарномуКонтролю = "";
	КонецЕсли;
	
	Если ВидПродукции <> МодульКлиента().Перечисление_ВидыПродукции().Пиво Тогда
		ЭтоКег = "";
	КонецЕсли;
	
	НастроитьТаблицуТоваров();
	
	НастроитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоКегПриИзменении(Элемент)
	
	НастроитьТаблицуТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокПриАктивизацииОбласти(Элемент)
	
	Если Элемент.ТекущаяОбласть <> Неопределено Тогда
		Элементы.ТабДок.Редактирование = (Лев(Элемент.ТекущаяОбласть.Имя, 3) <> "R1C");
	КонецЕсли;
	
КонецПроцедуры

// #КонецОбласти

// #Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьТовары(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	МассивGTIN = ВсеGTINИзТаблицы();
	Если Не ЗначениеЗаполнено(МассивGTIN) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Загрузка товаров из таблицы:'");
	МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
	
	Результат = ЗагрузитьТоварыИзТаблицы(МассивGTIN);
	МодульКлиента().СообщитьРезультатЗагрузкиТоваров(Результат, УникальныйИдентификатор);
	
	Оповестить("КонтурМаркировка_Товар_Изменен");
	
	Функциональности = МодульКлиента().Перечисление_ФункциональностьМодуля();
	МодульКлиента().СтекМетрик_ДобавитьФункциональность(Функциональности.ЗагрузкаТоваровИзТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИЗаполнитьИзНациональногоКаталога(Команда)
	
	Если Не МодульКлиента().ПроверитьУстановленнуюВерсиюМодуля() Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	МассивGTIN = ВсеGTINИзТаблицы();
	Если Не ЗначениеЗаполнено(МассивGTIN) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = НСтр("ru = 'Загрузка товаров из таблицы:'");
	МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
	
	ОбновлятьТовары = Ложь;
	Результат = ЗагрузитьТоварыИзТаблицы(МассивGTIN, ОбновлятьТовары);
	МодульКлиента().СообщитьРезультатЗагрузкиТоваров(Результат, УникальныйИдентификатор);
	
	ТекстСообщения = НСтр("ru = 'Заполнение из национального каталога:'");
	МодульКлиента().СообщитьПользователюЛок(ТекстСообщения, УникальныйИдентификатор);
	МодульКлиента().ОбновитьТоварыИзНациональногоКаталога(МассивGTIN, УникальныйИдентификатор);
	
	Функциональности = МодульКлиента().Перечисление_ФункциональностьМодуля();
	Функциональность = Функциональности.ЗагрузкаТоваровИзТаблицыИНацКаталога;
	МодульКлиента().СтекМетрик_ДобавитьФункциональность(Функциональность);
	
КонецПроцедуры

// #КонецОбласти

// #Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьЭлементыФормы()
	
	Элементы.ПодлежитВетеринарномуКонтролю.Видимость = МодульКлиента().ВидПродукцииПоддерживаетВСД(ВидПродукции);
	Элементы.ТипСрокаГодности.Видимость = МодульКлиента().ВидПродукцииТребуетУказатьТипСрокаГодности(ВидПродукции);
	Элементы.ЭтоКег.Видимость = ВидПродукцииПоставляетсяВКегах();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	СписокВыбора = Элементы.ВидПродукции.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().ВсеВидыПродукции();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
	СписокВыбора = Элементы.ТипСрокаГодности.СписокВыбора;
	ЗначенияСписка = МодульОбъекта().Перечисление_ТипыСроковГодности();
	МодульОбъекта().ЗаполнитьСписокВыбора(СписокВыбора, ЗначенияСписка);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьТаблицуТоваров()
	
	ТаблицаТоваров.Очистить();
	
	Макет = МодульОбъекта().ПолучитьМакет("ШаблонЗагрузкиТовара");
	ТаблицаТоваров.Вывести(Макет.ПолучитьОбласть("ОбщиеПоля"));
	
	Если ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Пиво И ЭтоКег = "1" Тогда
		ТаблицаТоваров.Присоединить(Макет.ПолучитьОбласть("НоминальноеКоличество"));
	КонецЕсли;
	
	ТаблицаТоваров.ФиксацияСверху = 1;
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьТоварыИзТаблицы(МассивGTIN, ОбновлятьТовары = Истина)
	
	СозданоТоваров = 0;
	ОбновленоТоваров = 0;
	
	ТоварыВБазе = НайтиТовары(МассивGTIN);
	ОписанияТоваровИзТаблицы = ОписанияТоваровИзТаблицы(МассивGTIN);
	
	Для каждого GTIN Из МассивGTIN Цикл
		
		Товар = ТоварыВБазе[GTIN];
		ОписаниеТовараИзТаблицы = ОписанияТоваровИзТаблицы[GTIN];
		ЭтоНовыйТовар = Не ЗначениеЗаполнено(Товар);
		ТоварОбновлен = Ложь;
		
		Если ЭтоНовыйТовар Тогда
			ОписаниеТовара = ОписаниеТовараИзТаблицы;
		Иначе
			ОписаниеТовара = МодульОбъекта().Товар_Прочитать(Товар);
			ЗаполнитьТоварОписаниемИзТаблицы(ОписаниеТовара, ОписаниеТовараИзТаблицы, ТоварОбновлен);
		КонецЕсли;
		
		ЗаполнитьТоварРеквизитамиШапки(ОписаниеТовара, ТоварОбновлен);
		
		Если ЭтоНовыйТовар Тогда
			СозданоТоваров = СозданоТоваров + 1;
		ИначеЕсли ТоварОбновлен Тогда
			ОбновленоТоваров = ОбновленоТоваров + 1;
		Иначе
			Продолжить;
		КонецЕсли;
		
		МодульОбъекта().Товар_Записать(ОписаниеТовара);
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("СозданоТоваров", СозданоТоваров);
	Результат.Вставить("ОбновленоТоваров", ОбновленоТоваров);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТоварРеквизитамиШапки(ОписаниеТовара, ТоварОбновлен)
	
	Если ЗначениеЗаполнено(ВидПродукции)
		И ОписаниеТовара.ВидПродукции <> ВидПродукции Тогда
		ОписаниеТовара.ВидПродукции = ВидПродукции;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Производитель)
		И ОписаниеТовара.Производитель <> Производитель Тогда
		ОписаниеТовара.Производитель = Производитель;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВладелецКарточкиТовара)
		И ОписаниеТовара.ВладелецКарточкиТовара <> ВладелецКарточкиТовара Тогда
		ОписаниеТовара.ВладелецКарточкиТовара = ВладелецКарточкиТовара;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипСрокаГодности)
		И ОписаниеТовара.ТипСрокаГодности <> ТипСрокаГодности Тогда
		ОписаниеТовара.ТипСрокаГодности = ТипСрокаГодности;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодлежитВетеринарномуКонтролю)
		И ОписаниеТовара.ПодлежитВетеринарномуКонтролю <> БулевоИзСтроки(ПодлежитВетеринарномуКонтролю) Тогда
		ОписаниеТовара.ПодлежитВетеринарномуКонтролю = БулевоИзСтроки(ПодлежитВетеринарномуКонтролю);
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтоКег)
		И ОписаниеТовара.ДопРеквизиты.ЭтоКег <> БулевоИзСтроки(ЭтоКег) Тогда
		ОписаниеТовара.ДопРеквизиты.ЭтоКег = БулевоИзСтроки(ЭтоКег);
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипКодаМаркировки)
		И ОписаниеТовара.ТипКодаМаркировки <> ТипКодаМаркировки Тогда
		ОписаниеТовара.ТипКодаМаркировки = ТипКодаМаркировки;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварОписаниемИзТаблицы(ОписаниеТовара, ОписаниеТовараИзТаблицы, ТоварОбновлен)
	
	Если ЗначениеЗаполнено(ОписаниеТовараИзТаблицы.Наименование)
		И ОписаниеТовара.Наименование <> ОписаниеТовараИзТаблицы.Наименование Тогда
		ОписаниеТовара.Наименование = ОписаниеТовараИзТаблицы.Наименование;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеТовараИзТаблицы.Артикул)
		И ОписаниеТовара.Артикул <> ОписаниеТовараИзТаблицы.Артикул Тогда
		ОписаниеТовара.Артикул = ОписаниеТовараИзТаблицы.Артикул;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеТовараИзТаблицы.КодТНВЭД)
		И ОписаниеТовара.КодТНВЭД <> ОписаниеТовараИзТаблицы.КодТНВЭД Тогда
		ОписаниеТовара.КодТНВЭД = ОписаниеТовараИзТаблицы.КодТНВЭД;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеТовараИзТаблицы.ДопРеквизиты.НоминальноеКоличество)
		И ОписаниеТовара.ДопРеквизиты.НоминальноеКоличество <> ОписаниеТовараИзТаблицы.ДопРеквизиты.НоминальноеКоличество Тогда
		ОписаниеТовара.ДопРеквизиты.НоминальноеКоличество = ОписаниеТовараИзТаблицы.ДопРеквизиты.НоминальноеКоличество;
		ТоварОбновлен = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОписанияТоваровИзТаблицы(МассивGTIN)
	
	КолонкаШтрихкод = 1;
	КолонкаНаименование = 2;
	КолонкаАртикул = 3;
	КолонкаКодТНВЭД = 4;
	КолонкаНоминальноеКоличество = 5;
	
	Результат = Новый Соответствие;
	
	Для Сч = 2 По ТаблицаТоваров.ВысотаТаблицы Цикл
		
		Штрихкод = ТекстЯчейки(ТаблицаТоваров, Сч, КолонкаШтрихкод);
		Если Не ЗначениеЗаполнено(Штрихкод) Тогда
			Продолжить;
		КонецЕсли;
		
		GTIN = МодульОбъекта().GTINизШтрихкодаEAN(Штрихкод);
		Если МассивGTIN.Найти(GTIN) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОписаниеТовара = МодульОбъекта().Новый_Товар();
		ОписаниеТовара.GTIN = GTIN;
		ОписаниеТовара.Наименование = ТекстЯчейки(ТаблицаТоваров, Сч, КолонкаНаименование);
		ОписаниеТовара.Артикул = ТекстЯчейки(ТаблицаТоваров, Сч, КолонкаАртикул);
		ОписаниеТовара.КодТНВЭД = ТекстЯчейки(ТаблицаТоваров, Сч, КолонкаКодТНВЭД);
		
		Если ВидПродукции = Перечисления.КонтурМаркировка_ВидыПродукции.Пиво Тогда
			ЧислоСтрокой = ТекстЯчейки(ТаблицаТоваров, Сч, КолонкаНоминальноеКоличество);
			ОписаниеТовара.ДопРеквизиты.НоминальноеКоличество = МодульОбъекта().ЧислоИзСтроки(ЧислоСтрокой);
		КонецЕсли;
		
		Результат.Вставить(GTIN, ОписаниеТовара);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ВсеGTINИзТаблицы()
	
	КолонкаШтрихкод = 1;
	КолонкаНаименование = 2;
	КолонкаАртикул = 3;
	КолонкаКодТНВЭД = 4;
	КолонкаНоминальноеКоличество = 5;
	
	Результат = Новый Массив;
	
	Для Сч = 2 По ТаблицаТоваров.ВысотаТаблицы Цикл
		
		Штрихкод = ТекстЯчейки(ТаблицаТоваров, Сч, КолонкаШтрихкод);
		Если Не ЗначениеЗаполнено(Штрихкод) Тогда
			Продолжить;
		КонецЕсли;
		
		GTIN = МодульОбъекта().GTINизШтрихкодаEAN(Штрихкод);
		Если Не ПроверитьGTIN(GTIN) Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(GTIN);
		
	КонецЦикла;
	
	МодульОбъекта().СвернутьМассивЛок(Результат);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПроверитьGTIN(GTIN)
	
	Результат = МодульОбъекта().ПроверитьКорректностьGTIN(GTIN);
	
	Если Не Результат Тогда
		ШаблонОшибки = НСтр("ru = 'Некорректный GTIN: %1'");
		ТекстОшибки = МодульОбъекта().ПараметрыВСтроку(ШаблонОшибки, GTIN);
		МодульОбъекта().СообщитьПользователюЛок(ТекстОшибки, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НайтиТовары(МассивGTIN)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.GTIN КАК GTIN,
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурМаркировка_Товары КАК Т
	|ГДЕ
	|	Т.GTIN В(&МассивGTIN)");
	Запрос.УстановитьПараметр("МассивGTIN", МассивGTIN);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.GTIN, Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ТекстЯчейки(Область, Строка, Колонка)
	
	Результат = СокрЛП(Область.ПолучитьОбласть(Строка, Колонка).Область().Текст);
	
	Возврат Результат;
	
КонецФункции

Функция БулевоИзСтроки(Строка)
	
	Возврат Булево(Число(Строка));
	
КонецФункции

&НаКлиенте
Функция ВидПродукцииПоставляетсяВКегах() Экспорт
	
	Если ВидПродукции = МодульКлиента().Перечисление_ВидыПродукции().Пиво Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// #КонецОбласти
